build/ovpl-kit/docs/ovpl-installation.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>y#+Title:  OVPL Installation Process</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="[2014-09-16 Tue]"/>
<meta name="author" content="Thirumal R, Prakash B Hegade and Amulya Sri, (VLEAD)"/>
<link rel="stylesheet" type="text/css" href="css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="css/override.css" />
</head><body>
<h1 class="title">y#+Title:  OVPL Installation Process</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Set up proxy </a></li>
<li><a href="#sec-2">2 Cloning </a></li>
<li><a href="#sec-3">3 Installing OpenVZ </a></li>
<li><a href="#sec-4">4 Installing OVPL Dependencies </a></li>
<li><a href="#sec-5">5 Installing OVPL </a></li>
<li><a href="#sec-6">6 Deploying the Lab </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Set up proxy </h2>
<div id="text-1">

<ul>
<li>
Replace the &lt;value&gt; in the below commands with the values provided by your network admin to set the proxies.



<pre class="example">
 export http_proxy="&lt;value&gt;"
 export https_proxy="&lt;value&gt;"
</pre>




</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Cloning </h2>
<div id="text-2">

<ul>
<li>
Clone the LIK repository by running the command below.



<pre class="example">
 git clone https://github.com/Virtual-Labs/lab-integration-kit-v0.5.git
</pre>




</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Installing OpenVZ </h2>
<div id="text-3">

<ul>
<li>
In the src/ovpl-kit/scripts directory, "openvz-install.sh" installs OpenVZ on Your CentOS.
</li>
<li>
You have to run this script by the command below from src/ovpl-kit/scripts directory.



<pre class="example">
 sudo sh openvz-install.sh
</pre>




</li>
</ul>

<p>Reboot the system after installation of openVZ and login with openVZ kernel.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Installing OVPL Dependencies </h2>
<div id="text-4">

<ul>
<li>
In the src/ovpl-kit/scripts/dependencies directory, "dependencies.sh" installs all the dependencies required for running OVPL. 
</li>
<li>
You have to run this script by running the command below from src/ovpl-kit/scripts/dependencies directory.



<pre class="example">
sudo sh dependencies.sh
</pre>





</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">5 Installing OVPL </h2>
<div id="text-5">

<ul>
<li>
OVPL source code is present in src/ovpl-kit/ovpl directory.
</li>
</ul>

<p>Pre-requisites
</p><ul>
<li>
Change the values of proxies in src/ovpl-kit/ovpl/config/config.json
</li>
<li>
Change the SUBNET values in src/ovpl-kit/ovpl/src/settings.py and src/ovpl-kit/ovpl/src/adapters/settings.py
to match the subnet of your base machine.

</li>
<li>
Now go to src/ovpl-kit/ovpl/src/ and run make.



<pre class="example">
make
</pre>



<p>
This will run both the controller server and adapter server. Check this by running
</p>



<pre class="example">
ps -eaf | grep python2
</pre>





</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">6 Deploying the Lab </h2>
<div id="text-6">

<ul>
<li>
Go to browser and type, "127.0.0.1:8080", you will see a test page.
</li>
<li>
Enter lab id and URL and submit it.
</li>
<li>
You can see the deployment status of the lab in the terminal. The IP address of the container is prompted in the terminal where the lab is being deployed.
</li>
<li>
Lab can be hence used from the given IP.
</li>
<li>
Check the logs at /root/log/ovpl.log and /ovpl/root/centosvzadapter.log on the base machine.
</li>
<li>
Check the logs on the container at /root/VMManager/log/vmmanager.log


</li>
</ul>
</div>
</div>
<div id="postamble"><p class="author"> Author: Thirumal R, Prakash B Hegade and Amulya Sri, (VLEAD)
<a href="mailto:travula@vlabs.ac.in">&lt;travula@vlabs.ac.in&gt;</a>
<a href="mailto:prakash.hegade@vlabs.ac.in and amulya@vlabs.ac.in">&lt;prakash.hegade@vlabs.ac.in and amulya@vlabs.ac.in&gt;</a>
</p>
<p class="date"> Date: [2014-09-16 Tue]</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
